app/controllers/todos_controller.rb

    def index
        render plain: Todo.order(:due_date).map{|todo| todo.to_pleasant_string}.join("\n")
---
SELECT "todos".* FROM "todos" ORDER BY "todos"."due_date" ASC

    def show
        id = params[:id]
        todo = Todo.find(id)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
        todo_text = params[:todo_text]
        due_date = DateTime.parse(params[:due_date])
        new_todo = Todo.create!(todo_text: todo_text, due_date: due_date, completed: false)
---
INSERT INTO "todos" ("todo_text", "due_date", "completed") VALUES ($1, $2, $3) RETURNING "id"  [["todo_text", "This todo comes from postman"], ["due_date", "2020-04-04"], ["completed", false]]

    def update
        id = params[:id]
        completed = params[:completed]
        todo = Todo.find(id)
        todo.completed = completed
        todo.save!
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = $1 WHERE "todos"."id" = $2  [["completed", true], ["id", 7]]