app/controllers/users_controller.rb

    def index
        render plain: User.order(:id).map{|user| user.to_displayable_string}.join("\n")
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

    def login
        email = params[:email]
        password = params[:password]
        user = User.find_by "email = ? and password = ?", email, password
---
SELECT "users".* FROM "users" WHERE (email = 'vamsi123@gmail.com' and password = 'karthik123') LIMIT $1  [["LIMIT", 1]]

    def show
        id = params[:id]
        user = User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
        name = params[:name]
        email = params[:email]
        password = params[:password]
        new_user = User.create!(name: name, email: email, password: password)
---
INSERT INTO "users" ("name", "email", "password") VALUES ($1, $2, $3) RETURNING "id"  [["name", "karthik"], ["email", "karthik270@gmail.com"], ["password", "karthik@666"]]